In [36]:
from sqlalchemy import create_engine
import configparser
import logging

engine = create_engine("postgresql://postgres:5432@localhost:5432/db_latihan_sql")

In [37]:
import pandas as pd

pieces_df = pd.read_sql_query(f'select * from latihan_5.pieces', engine)
provides_df = pd.read_sql_query(f'select * from latihan_5.provides', engine)
providers_df = pd.read_sql_query(f'select * from latihan_5.providers', engine)
#show data of pieces
pieces_df

   code      name
0     1  Sprocket
1     2     Screw
2     3       Nut
3     4      Bolt

In [38]:
providers_df

   code                  name
0   HAL    Clarke Enterprises
1   RBT    Susan Calvin Corp.
2  TNBC  Skellington Supplies

In [39]:
provides_df

   piece provider  price
0      1      HAL     10
1      1      RBT     15
2      2      HAL     20
3      2      RBT     15
4      2     TNBC     14
5      3      RBT     50
6      3     TNBC     45
7      4      HAL      5
8      4      RBT      7